// 피자 프레임의 마지막 선택을 프로그램 재실행시에도 그대로 유지
// 정보의 파일 저장과 읽기를 어떤 형태로 할 것인가?
// 정보의 파일 저장과 읽기를 언제 수행할 것인가?

/*
	1. 기억장치의 특징인 휘발성/비휘발성은 무엇인가요?
	2. 파일 시스템의 다른 파일과 구별하기 위한 고유 식별자를 무엇이라 하나요?
	3. 파일 확장자는 무엇인가요?
	4. 윈도우 파일 시스템의 경로 구분자는?
		4-1. 상대 경로 | 절대 경로
	5. 파일 데이터의 끝을 의미하는 용어는?
	6. java.io.File 클래스의 생성은 어떻게? 역할은?
	7. 자바 IO 스트림은 데이터 전달 방향에 따라 입/출력 스트림
		읽고 쓰는 단위에 따라 바이트/문자 스트림 이 존재합니다.
		
		문자로 이루어진 텍스트 파일의 정보를 자바 어플리케이션 내에서 활용하고자 할 때,
		사용할 수 있는 클래스는? 
	8. 버퍼링 되지 않은 IO 스트림을 사용 시 Overhead가 발생합니다.
		BufferedInputStream/BufferedOutputStream - 바이트 스트림
		BufferedReader/BufferedWriter - 문자 스트림
		각 클래스의 생성자를 확인해보세요.
	9. 입출력 스트림이 더 이상 필요하지 않을 때 (or 사용이 끝난 경우에) 스트림을 닫는 것이 매우 중요합니다.
	 	예외가 발생하더라도 스트림이 닫히도록 문장 블럭을 구성하는 법?
	10. 
	
	etc. System.in / System.out 객체의 타입
 */
public class Keyword {

}